In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame

In [3]:
#point to the file location

In [4]:
cd C:\Users\Wei\Desktop

C:\Users\Wei\Desktop

In [5]:
#import csv file
data = pd.read_csv("Project 1.csv")

In [6]:
data

            City  On Time  Delayed Airline
0    Los Angeles      497       62  ALASKA
1        Phoenix      221       12  ALASKA
2      San Diego      212       20  ALASKA
3  San Francisco      503      102  ALASKA
4        Seattle     1841      305  ALASKA
5    Los Angeles      694      117  AMWEST
6        Phoenix     4840      415  AMWEST
7      San Diego      383       65  AMWEST
8  San Francisco      320      129  AMWEST
9        Seattle      201       61  AMWEST

In [7]:
#Convert data to list
List = data.values.tolist()

In [8]:
List

[['Los Angeles', 497, 62, 'ALASKA'],
 ['Phoenix', 221, 12, 'ALASKA'],
 ['San Diego', 212, 20, 'ALASKA'],
 ['San Francisco', 503, 102, 'ALASKA'],
 ['Seattle', 1841, 305, 'ALASKA'],
 ['Los Angeles', 694, 117, 'AMWEST'],
 ['Phoenix', 4840, 415, 'AMWEST'],
 ['San Diego', 383, 65, 'AMWEST'],
 ['San Francisco', 320, 129, 'AMWEST'],
 ['Seattle', 201, 61, 'AMWEST']]

In [9]:
#extract ALASKA airline to a list
List2 = [item[2] for item in List if item[3]=='ALASKA']

In [10]:
List2

[62, 12, 20, 102, 305]

In [11]:
#extract AMWEST airline to a list
List3 = [item[2] for item in List if item[3]=='AMWEST']

In [12]:
List3

[117, 415, 65, 129, 61]

In [13]:
length = len(List2)

In [14]:
#Calculate the arrival delyas for the 2 airlines
arrival_delays = [List3[i] - List2[i] for i in range(length)]

In [15]:
arrival_delays

[55, 403, 45, 27, -244]

In [16]:
#visualize the data
new_df = DataFrame({'AMWEST':List3,'ALASKA':List2,"Difference":arrival_delays})

In [17]:
new_df

   AMWEST  ALASKA  Difference
0     117      62          55
1     415      12         403
2      65      20          45
3     129     102          27
4      61     305        -244